{
  "name": "Crock Pot",
  "icon": "crockpot:crock_pot_basic",
  "category": "crockpot:intro",
  "priority": true,
  "pages": [
    {
      "type": "patchouli:text",
      "text": "$(pot)Crock Pot$() is a block that is used to cook a variety of belly-filling dishes with basic ingredients.$(br)A $(pot)Crock Pot$() has 4 slots for ingredients, each of which must be filled with a piece of food for it to start cooking. There's also a slot for fuel, which uses regular furnace fuel."
    },
    {
      "type": "patchouli:text",
      "text": "There are many recipes available for the $(pot)Crock Pot$(), but a successful cooking attempt requires all the ingredients to match a recipe. If an attempt fails to match any recipe at all, you'll end up with $(item)Wet Goop$() as the cooking result."
    },
    {
      "type": "patchouli:text",
      "text": "A cooking attempt also takes account of all the ingredient values that the provided foods contain. Almost all recipes require some amount of $(l:intro/ingredient)ingredient values$() from certain food categories, but there's also a lot of recipes with specific food requirements."
    },
    {
      "type": "patchouli:text",
      "text": "Lots of ingredients fulfill recipe requirements more efficiently than others (e.g. 1 $(item)Porkchop$() has the same effect on a dish as 2 $(item)Chicken$()). More filling ingredients tend to have greater food values.$(br2)Each recipe also has a weight, so that a result can be decided when a set of ingredients matches more than one valid recipe. These weights are called recipe $(l:intro/priority)priorities$()."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "crockpot:crafting/crock_pot_basic",
      "text": "There are 3 tiers of $(pot)Crock Pot$(). Some recipes need a higher tier of $(pot)Crock Pot$() to cook. Higher tier of $(pot)Crock Pots$() also have faster cooking speeds."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "crockpot:crafting/crock_pot_advanced",
      "recipe2": "crockpot:crafting/crock_pot_ultimate"
    }
  ]
}